TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_xcmp_dma/am263x-cc/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --package "ZCZ" --part "AM263x" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.18.0+3266"}
 */

/**
 * Import the modules used in this configuration.
 */
const edma       = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1      = edma.addInstance();
const epwm       = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1      = epwm.addInstance();
const epwm2      = epwm.addInstance();
const epwm3      = epwm.addInstance();
const epwm4      = epwm.addInstance();
const epwm5      = epwm.addInstance();
const epwm6      = epwm.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const int_xbar   = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1  = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
edma1.$name                 = "CONFIG_EDMA0";
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

epwm1.$name                                                  = "CONFIG_EPWM0";
epwm1.epwmTimebase_period                                    = 100;
epwm1.epwmXCMP_enableMode                                    = true;
epwm1.epwmXCMP_SplitCheck                                    = true;
epwm1.epwmXCMP_Split_A                                       = "EPWM_XCMP_4_CMPA";
epwm1.epwmXCMP_Split_B                                       = "EPWM_XCMP_4_CMPB";
epwm1.epwmXCMP1_Active                                       = 10;
epwm1.epwmXCMP2_Active                                       = 20;
epwm1.epwmXCMP3_Active                                       = 30;
epwm1.epwmXCMP4_Active                                       = 40;
epwm1.epwmXCMP5_Active                                       = 50;
epwm1.epwmXCMP6_Active                                       = 60;
epwm1.epwmXCMP7_Active                                       = 70;
epwm1.epwmXCMP8_Active                                       = 80;
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXTBPRD_Active                                      = 100;
epwm1.epwmXLOADCTL_Shadowlevel                               = "EPWM_XCMP_XLOADCTL_SHDWLEVEL_3";
epwm1.epwmXTBPRD_Shdw1                                       = 100;
epwm1.epwmXTBPRD_Shdw2                                       = 100;
epwm1.epwmXTBPRD_Shdw3                                       = 100;
epwm1.epwmXCMP1_Shdw1                                        = 10;
epwm1.epwmXCMP2_Shdw1                                        = 20;
epwm1.epwmXCMP3_Shdw1                                        = 30;
epwm1.epwmXCMP4_Shdw1                                        = 40;
epwm1.epwmXCMP5_Shdw1                                        = 50;
epwm1.epwmXCMP6_Shdw1                                        = 60;
epwm1.epwmXCMP7_Shdw1                                        = 70;
epwm1.epwmXCMP8_Shdw1                                        = 80;
epwm1.epwmXCMP1_Shdw2                                        = 10;
epwm1.epwmXCMP2_Shdw2                                        = 20;
epwm1.epwmXCMP3_Shdw2                                        = 30;
epwm1.epwmXCMP4_Shdw2                                        = 40;
epwm1.epwmXCMP5_Shdw2                                        = 50;
epwm1.epwmXCMP6_Shdw2                                        = 60;
epwm1.epwmXCMP7_Shdw2                                        = 70;
epwm1.epwmXCMP8_Shdw2                                        = 80;
epwm1.epwmXCMP1_Shdw3                                        = 10;
epwm1.epwmXCMP2_Shdw3                                        = 20;
epwm1.epwmXCMP3_Shdw3                                        = 30;
epwm1.epwmXCMP4_Shdw3                                        = 40;
epwm1.epwmXCMP5_Shdw3                                        = 50;
epwm1.epwmXCMP6_Shdw3                                        = 60;
epwm1.epwmXCMP7_Shdw3                                        = 70;
epwm1.epwmXCMP8_Shdw3                                        = 80;
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_2 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_2 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_3 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_3 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXLOADCTL_RepeatBuf3                                = 5;
epwm1.epwmXLOADCTL_RepeatBuf2                                = 5;
epwm1.epwmTimebase_emulationMode                             = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmXLOADCTL_Loadmode                                  = "EPWM_XCMP_XLOADCTL_LOADMODE_LOADMULTIPLE";
epwm1.EPWM.$assign                                           = "EPWM0";

